Revit 2026 API

# RepeaterBounds Class

---

Represents bounds of the array of repeating references in 0, 1, or 2 dimensions. (See RepeatingReferenceSource).

SystemObject Autodesk.Revit.DBRepeaterBounds

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RepeaterBounds : IDisposable
```
```vb
Public Class RepeaterBounds
	Implements IDisposable
```
```cpp
public ref class RepeaterBounds : IDisposable
```
```fsharp
type RepeaterBounds =
    class
        interface IDisposable
    end
```

The RepeaterBounds type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DimensionCount | The number of dimensions of the bounds (0, 1 or 2 for zero, one or two dimensional arrays.) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | AdjustForCyclicalBounds | Shifts the input coordinates in the cyclical dimensions so that they fall in the [lower bounds, upper bounds] range. |
|  | AreCoordinatesInBounds | Determines whether given coordinates are within the bounds. |
|  | Dispose | Releases all resources used by the RepeaterBounds |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLowerBound | Returns the smallest index of the array in the given dimension. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetUpperBound | Returns the highest index of the array in the given dimension. |
|  | IsCyclical | True if the array doesn't have finite bounds in the given dimension. Cyclical bounds indicate that the array forms a closed loop in the given dimension. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace